Revit 2027 API
BuiltInFailures.CurtainGridFamilyFailures.NonSystemPanelFamiliesCannotBeUsed Property
 Non-system panel families cannot be used for non-rectangular panels. If your panel is simple, create an appropriate panel type derived from the system panel family. If not, try making the panel in the wall or roof rectangular, and then using a panel family of the desired (non-rectangular) shape. The wall will then conform to the non-rectangular shape of the panel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NonSystemPanelFamiliesCannotBeUsed { get; }
Public Shared ReadOnly Property NonSystemPanelFamiliesCannotBeUsed As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NonSystemPanelFamiliesCannotBeUsed {
	FailureDefinitionId^ get ();
}
static member NonSystemPanelFamiliesCannotBeUsed : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainGridFamilyFailures Class
Autodesk.Revit.DB Namespace